Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LE_DFP/1.0.110/include/pio/pic32cm2532le00100.h
#define PIN_PB02B_AC_AIN4                          _UL_(34)    
#define MUX_PB02B_AC_AIN4                          _UL_(1)     
#define PINMUX_PB02B_AC_AIN4                       ((PIN_PB02B_AC_AIN4 << 16) | MUX_PB02B_AC_AIN4)
#define PORT_PB02B_AC_AIN4                         (_UL_(1) << 2)

#define PIN_PB03B_AC_AIN5                          _UL_(35)    
#define MUX_PB03B_AC_AIN5                          _UL_(1)     
#define PINMUX_PB03B_AC_AIN5                       ((PIN_PB03B_AC_AIN5 << 16) | MUX_PB03B_AC_AIN5)
#define PORT_PB03B_AC_AIN5                         (_UL_(1) << 3)

#define PIN_PB04B_AC_AIN6                          _UL_(36)    
#define MUX_PB04B_AC_AIN6                          _UL_(1)     
#define PINMUX_PB04B_AC_AIN6                       ((PIN_PB04B_AC_AIN6 << 16) | MUX_PB04B_AC_AIN6)
#define PORT_PB04B_AC_AIN6                         (_UL_(1) << 4)

#define PIN_PB05B_AC_AIN7                          _UL_(37)    
#define MUX_PB05B_AC_AIN7                          _UL_(1)     
#define PINMUX_PB05B_AC_AIN7                       ((PIN_PB05B_AC_AIN7 << 16) | MUX_PB05B_AC_AIN7)
#define PORT_PB05B_AC_AIN7                         (_UL_(1) << 5)

#define PIN_PA12H_AC_CMP0                          _UL_(12)    
#define MUX_PA12H_AC_CMP0                          _UL_(7)     
#define PINMUX_PA12H_AC_CMP0                       ((PIN_PA12H_AC_CMP0 << 16) | MUX_PA12H_AC_CMP0)
#define PORT_PA12H_AC_CMP0                         (_UL_(1) << 12)

#define PIN_PA18H_AC_CMP0                          _UL_(18)    
#define MUX_PA18H_AC_CMP0                          _UL_(7)     
#define PINMUX_PA18H_AC_CMP0                       ((PIN_PA18H_AC_CMP0 << 16) | MUX_PA18H_AC_CMP0)
#define PORT_PA18H_AC_CMP0                         (_UL_(1) << 18)

#define PIN_PA13H_AC_CMP1                          _UL_(13)    
#define MUX_PA13H_AC_CMP1                          _UL_(7)     
#define PINMUX_PA13H_AC_CMP1                       ((PIN_PA13H_AC_CMP1 << 16) | MUX_PA13H_AC_CMP1)
#define PORT_PA13H_AC_CMP1                         (_UL_(1) << 13)

#define PIN_PA19H_AC_CMP1                          _UL_(19)    
#define MUX_PA19H_AC_CMP1                          _UL_(7)     
#define PINMUX_PA19H_AC_CMP1                       ((PIN_PA19H_AC_CMP1 << 16) | MUX_PA19H_AC_CMP1)
#define PORT_PA19H_AC_CMP1                         (_UL_(1) << 19)

#define PIN_PB24H_AC_CMP2                          _UL_(56)    
#define MUX_PB24H_AC_CMP2                          _UL_(7)     
#define PINMUX_PB24H_AC_CMP2                       ((PIN_PB24H_AC_CMP2 << 16) | MUX_PB24H_AC_CMP2)
#define PORT_PB24H_AC_CMP2                         (_UL_(1) << 24)

#define PIN_PA24H_AC_CMP2                          _UL_(24)    
#define MUX_PA24H_AC_CMP2                          _UL_(7)     
#define PINMUX_PA24H_AC_CMP2                       ((PIN_PA24H_AC_CMP2 << 16) | MUX_PA24H_AC_CMP2)
#define PORT_PA24H_AC_CMP2                         (_UL_(1) << 24)

#define PIN_PB25H_AC_CMP3                          _UL_(57)    
#define MUX_PB25H_AC_CMP3                          _UL_(7)     
#define PINMUX_PB25H_AC_CMP3                       ((PIN_PB25H_AC_CMP3 << 16) | MUX_PB25H_AC_CMP3)
#define PORT_PB25H_AC_CMP3                         (_UL_(1) << 25)

#define PIN_PA25H_AC_CMP3                          _UL_(25)    
#define MUX_PA25H_AC_CMP3                          _UL_(7)     
#define PINMUX_PA25H_AC_CMP3                       ((PIN_PA25H_AC_CMP3 << 16) | MUX_PA25H_AC_CMP3)
#define PORT_PA25H_AC_CMP3                         (_UL_(1) << 25)

/* ========== PORT definition for ADC peripheral ========== */
#define PIN_PA02B_ADC_AIN0                         _UL_(2)     
#define MUX_PA02B_ADC_AIN0                         _UL_(1)     
#define PINMUX_PA02B_ADC_AIN0                      ((PIN_PA02B_ADC_AIN0 << 16) | MUX_PA02B_ADC_AIN0)
#define PORT_PA02B_ADC_AIN0                        (_UL_(1) << 2)

#define PIN_PA03B_ADC_AIN1                         _UL_(3)     
#define MUX_PA03B_ADC_AIN1                         _UL_(1)     
#define PINMUX_PA03B_ADC_AIN1                      ((PIN_PA03B_ADC_AIN1 << 16) | MUX_PA03B_ADC_AIN1)
#define PORT_PA03B_ADC_AIN1                        (_UL_(1) << 3)

#define PIN_PA04B_ADC_AIN2                         _UL_(4)     
#define MUX_PA04B_ADC_AIN2                         _UL_(1)     
#define PINMUX_PA04B_ADC_AIN2                      ((PIN_PA04B_ADC_AIN2 << 16) | MUX_PA04B_ADC_AIN2)
#define PORT_PA04B_ADC_AIN2                        (_UL_(1) << 4)

#define PIN_PA05B_ADC_AIN3                         _UL_(5)     
#define MUX_PA05B_ADC_AIN3                         _UL_(1)     
#define PINMUX_PA05B_ADC_AIN3                      ((PIN_PA05B_ADC_AIN3 << 16) | MUX_PA05B_ADC_AIN3)
#define PORT_PA05B_ADC_AIN3                        (_UL_(1) << 5)

#define PIN_PA06B_ADC_AIN4                         _UL_(6)     
#define MUX_PA06B_ADC_AIN4                         _UL_(1)     
#define PINMUX_PA06B_ADC_AIN4                      ((PIN_PA06B_ADC_AIN4 << 16) | MUX_PA06B_ADC_AIN4)
#define PORT_PA06B_ADC_AIN4                        (_UL_(1) << 6)

#define PIN_PA07B_ADC_AIN5                         _UL_(7)     
#define MUX_PA07B_ADC_AIN5                         _UL_(1)     
#define PINMUX_PA07B_ADC_AIN5                      ((PIN_PA07B_ADC_AIN5 << 16) | MUX_PA07B_ADC_AIN5)
#define PORT_PA07B_ADC_AIN5                        (_UL_(1) << 7)

#define PIN_PA08B_ADC_AIN6                         _UL_(8)     
#define MUX_PA08B_ADC_AIN6                         _UL_(1)     
#define PINMUX_PA08B_ADC_AIN6                      ((PIN_PA08B_ADC_AIN6 << 16) | MUX_PA08B_ADC_AIN6)
#define PORT_PA08B_ADC_AIN6                        (_UL_(1) << 8)

#define PIN_PA09B_ADC_AIN7                         _UL_(9)     
#define MUX_PA09B_ADC_AIN7                         _UL_(1)     
#define PINMUX_PA09B_ADC_AIN7                      ((PIN_PA09B_ADC_AIN7 << 16) | MUX_PA09B_ADC_AIN7)
#define PORT_PA09B_ADC_AIN7                        (_UL_(1) << 9)

#define PIN_PA10B_ADC_AIN8                         _UL_(10)    
#define MUX_PA10B_ADC_AIN8                         _UL_(1)     
#define PINMUX_PA10B_ADC_AIN8                      ((PIN_PA10B_ADC_AIN8 << 16) | MUX_PA10B_ADC_AIN8)
#define PORT_PA10B_ADC_AIN8                        (_UL_(1) << 10)

#define PIN_PA11B_ADC_AIN9                         _UL_(11)    
#define MUX_PA11B_ADC_AIN9                         _UL_(1)     
#define PINMUX_PA11B_ADC_AIN9                      ((PIN_PA11B_ADC_AIN9 << 16) | MUX_PA11B_ADC_AIN9)
#define PORT_PA11B_ADC_AIN9                        (_UL_(1) << 11)

#define PIN_PB02B_ADC_AIN10                        _UL_(34)    
#define MUX_PB02B_ADC_AIN10                        _UL_(1)     
#define PINMUX_PB02B_ADC_AIN10                     ((PIN_PB02B_ADC_AIN10 << 16) | MUX_PB02B_ADC_AIN10)
#define PORT_PB02B_ADC_AIN10                       (_UL_(1) << 2)

#define PIN_PB03B_ADC_AIN11                        _UL_(35)    
#define MUX_PB03B_ADC_AIN11                        _UL_(1)     
#define PINMUX_PB03B_ADC_AIN11                     ((PIN_PB03B_ADC_AIN11 << 16) | MUX_PB03B_ADC_AIN11)
#define PORT_PB03B_ADC_AIN11                       (_UL_(1) << 3)

#define PIN_PB04B_ADC_AIN12                        _UL_(36)    
#define MUX_PB04B_ADC_AIN12                        _UL_(1)     
#define PINMUX_PB04B_ADC_AIN12                     ((PIN_PB04B_ADC_AIN12 << 16) | MUX_PB04B_ADC_AIN12)
#define PORT_PB04B_ADC_AIN12                       (_UL_(1) << 4)

#define PIN_PB05B_ADC_AIN13                        _UL_(37)    
#define MUX_PB05B_ADC_AIN13                        _UL_(1)     
#define PINMUX_PB05B_ADC_AIN13                     ((PIN_PB05B_ADC_AIN13 << 16) | MUX_PB05B_ADC_AIN13)
#define PORT_PB05B_ADC_AIN13                       (_UL_(1) << 5)

#define PIN_PB06B_ADC_AIN14                        _UL_(38)    
#define MUX_PB06B_ADC_AIN14                        _UL_(1)     
#define PINMUX_PB06B_ADC_AIN14                     ((PIN_PB06B_ADC_AIN14 << 16) | MUX_PB06B_ADC_AIN14)
#define PORT_PB06B_ADC_AIN14                       (_UL_(1) << 6)

#define PIN_PB07B_ADC_AIN15                        _UL_(39)    
#define MUX_PB07B_ADC_AIN15                        _UL_(1)     
#define PINMUX_PB07B_ADC_AIN15                     ((PIN_PB07B_ADC_AIN15 << 16) | MUX_PB07B_ADC_AIN15)
#define PORT_PB07B_ADC_AIN15                       (_UL_(1) << 7)

#define PIN_PB00B_ADC_AIN16                        _UL_(32)    
#define MUX_PB00B_ADC_AIN16                        _UL_(1)     
#define PINMUX_PB00B_ADC_AIN16                     ((PIN_PB00B_ADC_AIN16 << 16) | MUX_PB00B_ADC_AIN16)
#define PORT_PB00B_ADC_AIN16                       (_UL_(1) << 0)

#define PIN_PB01B_ADC_AIN17                        _UL_(33)    
#define MUX_PB01B_ADC_AIN17                        _UL_(1)     
#define PINMUX_PB01B_ADC_AIN17                     ((PIN_PB01B_ADC_AIN17 << 16) | MUX_PB01B_ADC_AIN17)
#define PORT_PB01B_ADC_AIN17                       (_UL_(1) << 1)

#define PIN_PB08B_ADC_AIN18                        _UL_(40)    
#define MUX_PB08B_ADC_AIN18                        _UL_(1)     
#define PINMUX_PB08B_ADC_AIN18                     ((PIN_PB08B_ADC_AIN18 << 16) | MUX_PB08B_ADC_AIN18)
#define PORT_PB08B_ADC_AIN18                       (_UL_(1) << 8)

#define PIN_PB09B_ADC_AIN19                        _UL_(41)    
#define MUX_PB09B_ADC_AIN19                        _UL_(1)     
#define PINMUX_PB09B_ADC_AIN19                     ((PIN_PB09B_ADC_AIN19 << 16) | MUX_PB09B_ADC_AIN19)
#define PORT_PB09B_ADC_AIN19                       (_UL_(1) << 9)

