Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LE_DFP/1.0.110/include/pio/pic32cm2532le00100.h
#define PIN_PB15G_RTC_IN5                          _UL_(47)    
#define MUX_PB15G_RTC_IN5                          _UL_(6)     
#define PINMUX_PB15G_RTC_IN5                       ((PIN_PB15G_RTC_IN5 << 16) | MUX_PB15G_RTC_IN5)
#define PORT_PB15G_RTC_IN5                         (_UL_(1) << 15)

#define PIN_PC14G_RTC_IN6                          _UL_(78)    
#define MUX_PC14G_RTC_IN6                          _UL_(6)     
#define PINMUX_PC14G_RTC_IN6                       ((PIN_PC14G_RTC_IN6 << 16) | MUX_PC14G_RTC_IN6)
#define PORT_PC14G_RTC_IN6                         (_UL_(1) << 14)

#define PIN_PC15G_RTC_IN7                          _UL_(79)    
#define MUX_PC15G_RTC_IN7                          _UL_(6)     
#define PINMUX_PC15G_RTC_IN7                       ((PIN_PC15G_RTC_IN7 << 16) | MUX_PC15G_RTC_IN7)
#define PORT_PC15G_RTC_IN7                         (_UL_(1) << 15)

#define PIN_PA18G_RTC_OUT0                         _UL_(18)    
#define MUX_PA18G_RTC_OUT0                         _UL_(6)     
#define PINMUX_PA18G_RTC_OUT0                      ((PIN_PA18G_RTC_OUT0 << 16) | MUX_PA18G_RTC_OUT0)
#define PORT_PA18G_RTC_OUT0                        (_UL_(1) << 18)

#define PIN_PA19G_RTC_OUT1                         _UL_(19)    
#define MUX_PA19G_RTC_OUT1                         _UL_(6)     
#define PINMUX_PA19G_RTC_OUT1                      ((PIN_PA19G_RTC_OUT1 << 16) | MUX_PA19G_RTC_OUT1)
#define PORT_PA19G_RTC_OUT1                        (_UL_(1) << 19)

#define PIN_PA22G_RTC_OUT2                         _UL_(22)    
#define MUX_PA22G_RTC_OUT2                         _UL_(6)     
#define PINMUX_PA22G_RTC_OUT2                      ((PIN_PA22G_RTC_OUT2 << 16) | MUX_PA22G_RTC_OUT2)
#define PORT_PA22G_RTC_OUT2                        (_UL_(1) << 22)

#define PIN_PA23G_RTC_OUT3                         _UL_(23)    
#define MUX_PA23G_RTC_OUT3                         _UL_(6)     
#define PINMUX_PA23G_RTC_OUT3                      ((PIN_PA23G_RTC_OUT3 << 16) | MUX_PA23G_RTC_OUT3)
#define PORT_PA23G_RTC_OUT3                        (_UL_(1) << 23)

#define PIN_PB16G_RTC_OUT4                         _UL_(48)    
#define MUX_PB16G_RTC_OUT4                         _UL_(6)     
#define PINMUX_PB16G_RTC_OUT4                      ((PIN_PB16G_RTC_OUT4 << 16) | MUX_PB16G_RTC_OUT4)
#define PORT_PB16G_RTC_OUT4                        (_UL_(1) << 16)

#define PIN_PB17G_RTC_OUT5                         _UL_(49)    
#define MUX_PB17G_RTC_OUT5                         _UL_(6)     
#define PINMUX_PB17G_RTC_OUT5                      ((PIN_PB17G_RTC_OUT5 << 16) | MUX_PB17G_RTC_OUT5)
#define PORT_PB17G_RTC_OUT5                        (_UL_(1) << 17)

#define PIN_PB18G_RTC_OUT6                         _UL_(50)    
#define MUX_PB18G_RTC_OUT6                         _UL_(6)     
#define PINMUX_PB18G_RTC_OUT6                      ((PIN_PB18G_RTC_OUT6 << 16) | MUX_PB18G_RTC_OUT6)
#define PORT_PB18G_RTC_OUT6                        (_UL_(1) << 18)

#define PIN_PB19G_RTC_OUT7                         _UL_(51)    
#define MUX_PB19G_RTC_OUT7                         _UL_(6)     
#define PINMUX_PB19G_RTC_OUT7                      ((PIN_PB19G_RTC_OUT7 << 16) | MUX_PB19G_RTC_OUT7)
#define PORT_PB19G_RTC_OUT7                        (_UL_(1) << 19)

/* ========== PORT definition for SERCOM0 peripheral ========== */
#define PIN_PA04D_SERCOM0_PAD0                     _UL_(4)     
#define MUX_PA04D_SERCOM0_PAD0                     _UL_(3)     
#define PINMUX_PA04D_SERCOM0_PAD0                  ((PIN_PA04D_SERCOM0_PAD0 << 16) | MUX_PA04D_SERCOM0_PAD0)
#define PORT_PA04D_SERCOM0_PAD0                    (_UL_(1) << 4)

#define PIN_PA16D_SERCOM0_PAD0                     _UL_(16)    
#define MUX_PA16D_SERCOM0_PAD0                     _UL_(3)     
#define PINMUX_PA16D_SERCOM0_PAD0                  ((PIN_PA16D_SERCOM0_PAD0 << 16) | MUX_PA16D_SERCOM0_PAD0)
#define PORT_PA16D_SERCOM0_PAD0                    (_UL_(1) << 16)

#define PIN_PA22C_SERCOM0_PAD0                     _UL_(22)    
#define MUX_PA22C_SERCOM0_PAD0                     _UL_(2)     
#define PINMUX_PA22C_SERCOM0_PAD0                  ((PIN_PA22C_SERCOM0_PAD0 << 16) | MUX_PA22C_SERCOM0_PAD0)
#define PORT_PA22C_SERCOM0_PAD0                    (_UL_(1) << 22)

#define PIN_PB24C_SERCOM0_PAD0                     _UL_(56)    
#define MUX_PB24C_SERCOM0_PAD0                     _UL_(2)     
#define PINMUX_PB24C_SERCOM0_PAD0                  ((PIN_PB24C_SERCOM0_PAD0 << 16) | MUX_PB24C_SERCOM0_PAD0)
#define PORT_PB24C_SERCOM0_PAD0                    (_UL_(1) << 24)

#define PIN_PA05D_SERCOM0_PAD1                     _UL_(5)     
#define MUX_PA05D_SERCOM0_PAD1                     _UL_(3)     
#define PINMUX_PA05D_SERCOM0_PAD1                  ((PIN_PA05D_SERCOM0_PAD1 << 16) | MUX_PA05D_SERCOM0_PAD1)
#define PORT_PA05D_SERCOM0_PAD1                    (_UL_(1) << 5)

#define PIN_PA17D_SERCOM0_PAD1                     _UL_(17)    
#define MUX_PA17D_SERCOM0_PAD1                     _UL_(3)     
#define PINMUX_PA17D_SERCOM0_PAD1                  ((PIN_PA17D_SERCOM0_PAD1 << 16) | MUX_PA17D_SERCOM0_PAD1)
#define PORT_PA17D_SERCOM0_PAD1                    (_UL_(1) << 17)

#define PIN_PA23C_SERCOM0_PAD1                     _UL_(23)    
#define MUX_PA23C_SERCOM0_PAD1                     _UL_(2)     
#define PINMUX_PA23C_SERCOM0_PAD1                  ((PIN_PA23C_SERCOM0_PAD1 << 16) | MUX_PA23C_SERCOM0_PAD1)
#define PORT_PA23C_SERCOM0_PAD1                    (_UL_(1) << 23)

#define PIN_PB25C_SERCOM0_PAD1                     _UL_(57)    
#define MUX_PB25C_SERCOM0_PAD1                     _UL_(2)     
#define PINMUX_PB25C_SERCOM0_PAD1                  ((PIN_PB25C_SERCOM0_PAD1 << 16) | MUX_PB25C_SERCOM0_PAD1)
#define PORT_PB25C_SERCOM0_PAD1                    (_UL_(1) << 25)

#define PIN_PA06D_SERCOM0_PAD2                     _UL_(6)     
#define MUX_PA06D_SERCOM0_PAD2                     _UL_(3)     
#define PINMUX_PA06D_SERCOM0_PAD2                  ((PIN_PA06D_SERCOM0_PAD2 << 16) | MUX_PA06D_SERCOM0_PAD2)
#define PORT_PA06D_SERCOM0_PAD2                    (_UL_(1) << 6)

#define PIN_PA14D_SERCOM0_PAD2                     _UL_(14)    
#define MUX_PA14D_SERCOM0_PAD2                     _UL_(3)     
#define PINMUX_PA14D_SERCOM0_PAD2                  ((PIN_PA14D_SERCOM0_PAD2 << 16) | MUX_PA14D_SERCOM0_PAD2)
#define PORT_PA14D_SERCOM0_PAD2                    (_UL_(1) << 14)

#define PIN_PA18D_SERCOM0_PAD2                     _UL_(18)    
#define MUX_PA18D_SERCOM0_PAD2                     _UL_(3)     
#define PINMUX_PA18D_SERCOM0_PAD2                  ((PIN_PA18D_SERCOM0_PAD2 << 16) | MUX_PA18D_SERCOM0_PAD2)
#define PORT_PA18D_SERCOM0_PAD2                    (_UL_(1) << 18)

#define PIN_PA24C_SERCOM0_PAD2                     _UL_(24)    
#define MUX_PA24C_SERCOM0_PAD2                     _UL_(2)     
#define PINMUX_PA24C_SERCOM0_PAD2                  ((PIN_PA24C_SERCOM0_PAD2 << 16) | MUX_PA24C_SERCOM0_PAD2)
#define PORT_PA24C_SERCOM0_PAD2                    (_UL_(1) << 24)

#define PIN_PB22C_SERCOM0_PAD2                     _UL_(54)    
#define MUX_PB22C_SERCOM0_PAD2                     _UL_(2)     
#define PINMUX_PB22C_SERCOM0_PAD2                  ((PIN_PB22C_SERCOM0_PAD2 << 16) | MUX_PB22C_SERCOM0_PAD2)
#define PORT_PB22C_SERCOM0_PAD2                    (_UL_(1) << 22)

#define PIN_PC24C_SERCOM0_PAD2                     _UL_(88)    
#define MUX_PC24C_SERCOM0_PAD2                     _UL_(2)     
#define PINMUX_PC24C_SERCOM0_PAD2                  ((PIN_PC24C_SERCOM0_PAD2 << 16) | MUX_PC24C_SERCOM0_PAD2)
#define PORT_PC24C_SERCOM0_PAD2                    (_UL_(1) << 24)

#define PIN_PA02D_SERCOM0_PAD2                     _UL_(2)     
#define MUX_PA02D_SERCOM0_PAD2                     _UL_(3)     
#define PINMUX_PA02D_SERCOM0_PAD2                  ((PIN_PA02D_SERCOM0_PAD2 << 16) | MUX_PA02D_SERCOM0_PAD2)
#define PORT_PA02D_SERCOM0_PAD2                    (_UL_(1) << 2)

#define PIN_PA07D_SERCOM0_PAD3                     _UL_(7)     
#define MUX_PA07D_SERCOM0_PAD3                     _UL_(3)     
#define PINMUX_PA07D_SERCOM0_PAD3                  ((PIN_PA07D_SERCOM0_PAD3 << 16) | MUX_PA07D_SERCOM0_PAD3)
#define PORT_PA07D_SERCOM0_PAD3                    (_UL_(1) << 7)

